#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t
#+options: todo:t |:t
#+title: harvester-readme
#+date: <2021-02-08 Mon>
#+author: Gregory Grubbs
#+email: gregory@dynapse.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.0.50 (Org mode 9.4.4)
#+setupfile: ~/projects/emacs/org-html-themes/org/theme-readtheorg-local.setup

   Official site: [[https://harvesterhci.io/][Harvester - Open-source hyperconverged infrastructure]]

** Getting details about vms
   + Jsonpath for getting the CD image IDs
     #+begin_src bash
       kubectl -n default get vm \
               -o jsonpath='{.items[*].spec.dataVolumeTemplates[0].metadata.annotations.harvester\.cattle\.io/imageId}' ; echo
     #+end_src

     #+RESULTS:
     : default/image-q8l5g default/image-q8l5g default/image-pj8k8


   + Then use that to find the image used to create the VM
     #+begin_src bash
       kubectl -n default get vmimage image-q8l5g \
         -o custom-columns=NAME:.metadata.name,DISPLAY_NAME:.spec.displayName
     #+end_src

     #+RESULTS:
     | NAME        | DISPLAY_NAME                            |
     | image-q8l5g | opensuse-leap-15.2.x86_64-nocloud.qcow2 |
   + Info for the running VM instances
     #+begin_src bash
       kubectl -n default get virtualmachineinstances \
               -o custom-columns=NAME:.metadata.name,CPU:.spec.domain.cpu.cores,MAC:.spec.domain.devices.interfaces[].macAddress,IP:.status.interfaces[].ipAddress,HOSTNAME:.spec.hostname,NETWORK:.spec.networks[].name,DISK1:.spec.volumes[0].dataVolume.name
     #+end_src

     #+RESULTS:
     | NAME        | CPU | MAC               |         IP | HOSTNAME    | NETWORK | DISK1                      |
     | gg-party-3  |   2 | <none>            | 10.42.0.68 | gg-party-3  | default | gg-party-3-rootdisk-urvnp  |
     | gg-party-2  |   2 | <none>            | 10.42.0.69 | gg-party-2  | default | gg-party-2-rootdisk-0qens  |
     | gg-rescueme |   2 | 02:00:00:db:57:cc | 10.42.0.81 | gg-rescueme | default | gg-rescueme-rootdisk-alkif |
     | gg-party1   |   4 | <none>            | 10.42.0.85 | gg-party1   | default | gg-party1-disk-0-qz4fd     |
   + Simpler list of hostnames and IPs, just running =k get pod=
     #+begin_src bash :results table
       kubectl get pods -l kubevirt.io=virt-launcher \
         -o custom-columns=LAUNCHER_NAME:.metadata.name,HOSTNAME:.spec.hostname,IP:.status.podIP,STATUS:.status.phase \
         --sort-by=.spec.hostname
     #+end_src

     #+RESULTS:
     | LAUNCHER_NAME                      | HOSTNAME       |          IP | STATUS  |
     | virt-launcher-gg-harvestme-1-9ljzb | gg-harvestme-1 | 10.42.0.104 | Running |
     | virt-launcher-gg-harvestme-2-7ddpf | gg-harvestme-2 | 10.42.0.108 | Running |
     | virt-launcher-gg-harvestme-3-nbxlx | gg-harvestme-3 | 10.42.0.109 | Running |
     | virt-launcher-gg-rescueme-4ls6z    | gg-rescueme    |  10.42.0.81 | Running |

** Show/Change number of replicas on Longhorn volumes
   #+begin_src bash
     kubectl get volumes.longhorn.io -o custom-columns="NAME:metadata.name,STATE:status.state,NUMREPLICAS:spec.numberOfReplicas,ROBUSTNESS:status.robustness,SIZE:spec.size,ACTUAL:status.actualSize,NODE:status.currentNodeID"
   #+end_src

   #+RESULTS:
   | NAME                                     | STATE    | NUMREPLICAS | ROBUSTNESS |        SIZE |    ACTUAL | NODE                |
   | pvc-057fd8cd-6e7a-43e0-b9d3-0ebb8a34b838 | attached |           4 | degraded   | 21474836480 | 480030720 | chewbacca.magichome |
   | pvc-5868f344-11d7-4d5c-983f-673c6eff86b0 | attached |           2 | healthy    | 21474836480 | 480407552 | chewbacca.magichome |
   | pvc-7320258a-4bd3-4858-aae7-73aba22373ea | attached |           2 | healthy    | 21474836480 | 480378880 | chewbacca.magichome |
   | pvc-ff1c04f6-083b-4727-9aef-3e554ede73a9 | attached |           2 | healthy    | 21474836480 | 479825920 | chewbacca.magichome |

   #+begin_src bash
     kubectl -n longhorn-system patch  volume pvc-057fd8cd-6e7a-43e0-b9d3-0ebb8a34b838 --type merge -p '{"spec":{"numberOfReplicas": 2}}'
   #+end_src

   #+RESULTS:
   : volume.longhorn.io/pvc-057fd8cd-6e7a-43e0-b9d3-0ebb8a34b838 patched

** Work getting the certs from KUBECONFIG
   + Get the contexts to present to the user
      #+begin_src bash
        k config get-contexts -o name
      #+end_src
   + get cluster and user from selected context (e.g. =rancher=)
     #+begin_src bash :results output raw
       kubectl config view -o json|jq -r '.contexts[] | select(.name == "rancher") | .context'
     #+end_src

     #+RESULTS:
     {
       "cluster": "rancher",
       "user": "rancher"
     }
   + get cluster CA
     #+begin_src bash :results output raw
       kubectl config view --flatten -o json | jq -r '.clusters[] | select(.name == "rancher")' | sed 's,LS0.\+,blah-blah,'
     #+end_src

     #+RESULTS:
     {
       "name": "rancher",
       "cluster": {
         "server": "https://rancher.hypecyclist.org/k8s/clusters/local",
         "certificate-authority-data": "blah-blah
       }
     }
     {
       "name": "rancher",
       "cluster": {
         "server": "https://rancher.hypecyclist.org/k8s/clusters/local",
         "certificate-authority-data": "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJoekNDQVM2Z0F3SUJBZ0lCQURBS0JnZ3Foa2pPUFFRREFqQTdNUnd3R2dZRFZRUUtFeE5rZVc1aGJXbGoKYkdsemRHVnVaWEl0YjNKbk1Sc3dHUVlEVlFRREV4SmtlVzVoYldsamJHbHpkR1Z1WlhJdFkyRXdIaGNOTWpFdwpNekU0TURFeU9UTTVXaGNOTXpFd016RTJNREV5T1RNNVdqQTdNUnd3R2dZRFZRUUtFeE5rZVc1aGJXbGpiR2x6CmRHVnVaWEl0YjNKbk1Sc3dHUVlEVlFRREV4SmtlVzVoYldsamJHbHpkR1Z1WlhJdFkyRXdXVEFUQmdjcWhrak8KUFFJQkJnZ3Foa2pPUFFNQkJ3TkNBQVFSdEM1ZXEzWEZSSUY2alE1V1JjOXNhZGliU2NjaWxnVWh5S2x5VSttbgphNEY1WktLS05zQnQxT1dWcmpRbEFtYkRWdUVrejN1WkF2aGN0cnA2Zm5TOW95TXdJVEFPQmdOVkhROEJBZjhFCkJBTUNBcVF3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFLQmdncWhrak9QUVFEQWdOSEFEQkVBaUIyMEhEaTJhVzAKVnc2SVgvV25sT1VIelFvZm51UUsySlZlOEtha09rK2Z2d0lnS0FlOW9aQ2dNZVlnd0JLTERRWFI2VXNNR2V5ZwpUTEFzdlNQTW1DZjNGcEU9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0="
       }
     }
   + some elisp
     #+begin_src emacs-lisp
       (defun gjg/get-cluster-credentials ()
         "Oh yeah"
         (interactive)
         (let ((contexts (shell-command)

                )))
         (message "Well that was fun")
         )
     #+end_src
   + The contexts using org-babel
     #+name: gorto
     #+begin_src bash :results output table
       kubectl config get-contexts
     #+end_src

     #+RESULTS: gorto
     | CURRENT         | NAME             | CLUSTER          | AUTHINFO         | NAMESPACE |
     | *               | gg-harvester-lab | gg-harvester-lab | gg-harvester-lab |           |
     | gg-one-and-done | gg-one-and-done  | gg-one-and-done  |                  |           |
     | gg-rke-gcp      | gg-rke-gcp       | gg-rke-gcp       |                  |           |
     | rancher         | rancher          | rancher          |                  |           |

   + ohai
     #+begin_src emacs-lisp :var table=gorto
       (completing-read "Contexts: "
                        (mapcar (lambda (x) (nth 1 x)) table)
                        )
     #+end_src
   + A magic intermediate command
     #+begin_src bash
       HARVESTER_CONTEXT="gg-harvester-lab"
       HARVESTER_CLUSTER=`kubectl config view -o json|jq -r ".contexts[]|select(.name == \"${HARVESTER_CONTEXT}\") | .context.cluster"`
       HARVESTER_USER=`kubectl config view -o json|jq -r ".contexts[]|select(.name == \"${HARVESTER_CONTEXT}\") | .context.user"`
       HARVESTER_CLUSTER_CA=`kubectl config view --flatten -o json | jq -r ".clusters[] | select(.name == \"${HARVESTER_CLUSTER}\") | .cluster[\"certificate-authority-data\"]"`
       HARVESTER_URL=`kubectl config view --flatten -o json | jq -r ".clusters[] | select(.name == \"${HARVESTER_CLUSTER}\") | .cluster.server"`
       HARVESTER_USER_CERT=`kubectl config view --flatten -o json | jq -r ".users[] | select(.name == \"${HARVESTER_USER}\") | .user[\"client-certificate-data\"]"`
       HARVESTER_USER_KEY=`kubectl config view --flatten -o json | jq -r ".users[] | select(.name == \"${HARVESTER_USER}\") | .user[\"client-key-data\"]"`
       docker-machine create -d harvester \
                      --ca-cert ${HARVESTER_CLUSTER_CA} \
                      --cert ${HARVESTER_USER_CERT} \
                      --key  ${HARVESTER_USER_KEY} \
                      --harvester-url ${HARVESTER_URL} \
                      --cpus 3 \
                      --disk-size "42Gi" \
                      --keypair "k8s-local" \
                      --ssh-key-path "~/.ssh/k8s-local.pub" \
                      --ssh-user "gregj" \
                      --mem-size "4Gi" \
                      --vm-description "This is a hoooooot" \
                      --vm-name "gg-whatahoot" \
                      --image-id "image-m2d7r" \
                      gorto
     #+end_src
